gitpan/zxid/c/saml2-elems.c
    {"IPSec", "ac", zx_ns_tab + zx_xmlns_ix_ac},
#line 94 "c/saml2-elems.gperf"
    {"IDPList", "ff12", zx_ns_tab + zx_xmlns_ix_ff12},
#line 172 "c/saml2-elems.gperf"
    {"IDPList", "sp", zx_ns_tab + zx_xmlns_ix_sp},
#line 29 "c/saml2-elems.gperf"
    {"IPAddress", "ac", zx_ns_tab + zx_xmlns_ix_ac},
#line 92 "c/saml2-elems.gperf"
    {"IDPEntries", "ff12", zx_ns_tab + zx_xmlns_ix_ff12},
#line 79 "c/saml2-elems.gperf"
    {"X509Data", "ds", zx_ns_tab + zx_xmlns_ix_ds},
#line 258 "c/saml2-elems.gperf"
    {"AuthnContextDeclRef", "sa", zx_ns_tab + zx_xmlns_ix_sa},
#line 229 "c/saml2-elems.gperf"
    {"AuthnContextClassRef", "ff12", zx_ns_tab + zx_xmlns_ix_ff12},
#line 256 "c/saml2-elems.gperf"
    {"AuthnContextClassRef", "sa", zx_ns_tab + zx_xmlns_ix_sa},
#line 226 "c/saml2-elems.gperf"
    {"AffiliationID", "ff12", zx_ns_tab + zx_xmlns_ix_ff12},
#line 231 "c/saml2-elems.gperf"
    {"AuthnContextStatementRef", "ff12", zx_ns_tab + zx_xmlns_ix_ff12},
#line 37 "c/saml2-elems.gperf"
    {"MobileNetworkNoEncryption", "ac", zx_ns_tab + zx_xmlns_ix_ac},
#line 134 "c/saml2-elems.gperf"
    {"BaseID", "sa", zx_ns_tab + zx_xmlns_ix_sa},
#line 38 "c/saml2-elems.gperf"
    {"MobileNetworkRadioEncryption", "ac", zx_ns_tab + zx_xmlns_ix_ac},
#line 188 "c/saml2-elems.gperf"
    {"AgreementMethod", "xenc", zx_ns_tab + zx_xmlns_ix_xenc},
#line 36 "c/saml2-elems.gperf"
    {"MobileNetworkEndToEndEncryption", "ac", zx_ns_tab + zx_xmlns_ix_ac},
#line 281 "c/saml2-elems.gperf"
    {"TOK_NOT_FOUND", "ZX", 0},
#line 46 "c/saml2-elems.gperf"
    {"SSL", "ac", zx_ns_tab + zx_xmlns_ix_ac},
#line 176 "c/saml2-elems.gperf"
    {"ManageNameIDResponse", "sp", zx_ns_tab + zx_xmlns_ix_sp},
#line 26 "c/saml2-elems.gperf"
    {"GoverningAgreementRef", "ac", zx_ns_tab + zx_xmlns_ix_ac},
#line 228 "c/saml2-elems.gperf"
    {"AssertionConsumerServiceURL", "ff12", zx_ns_tab + zx_xmlns_ix_ff12},
#line 14 "c/saml2-elems.gperf"
    {"Alphabet", "ac", zx_ns_tab + zx_xmlns_ix_ac},
#line 234 "c/saml2-elems.gperf"
    {"IsPassive", "ff12", zx_ns_tab + zx_xmlns_ix_ff12},
#line 34 "c/saml2-elems.gperf"
    {"KeyStorage", "ac", zx_ns_tab + zx_xmlns_ix_ac},
#line 179 "c/saml2-elems.gperf"
    {"NameIDPolicy", "sp", zx_ns_tab + zx_xmlns_ix_sp},
#line 236 "c/saml2-elems.gperf"
    {"NameIDPolicy", "ff12", zx_ns_tab + zx_xmlns_ix_ff12},
#line 21 "c/saml2-elems.gperf"
    {"AuthenticatorTransportProtocol", "ac", zx_ns_tab + zx_xmlns_ix_ac},
#line 257 "c/saml2-elems.gperf"
    {"AuthnContextDecl", "sa", zx_ns_tab + zx_xmlns_ix_sa},
#line 112 "c/saml2-elems.gperf"
    {"AttributeStatement", "sa11", zx_ns_tab + zx_xmlns_ix_sa11},
#line 129 "c/saml2-elems.gperf"
    {"AttributeStatement", "sa", zx_ns_tab + zx_xmlns_ix_sa},
#line 111 "c/saml2-elems.gperf"
    {"AttributeDesignator", "sa11", zx_ns_tab + zx_xmlns_ix_sa11},
#line 224 "c/saml2-elems.gperf"
    {"XPath", "ds", zx_ns_tab + zx_xmlns_ix_ds},
#line 239 "c/saml2-elems.gperf"
    {"ProviderName", "ff12", zx_ns_tab + zx_xmlns_ix_ff12},
#line 223 "c/saml2-elems.gperf"
    {"X509SubjectName", "ds", zx_ns_tab + zx_xmlns_ix_ds},
#line 93 "c/saml2-elems.gperf"
    {"IDPEntry", "ff12", zx_ns_tab + zx_xmlns_ix_ff12},
#line 171 "c/saml2-elems.gperf"
    {"IDPEntry", "sp", zx_ns_tab + zx_xmlns_ix_sp},
#line 161 "c/saml2-elems.gperf"
    {"StatusDetail", "sp11", zx_ns_tab + zx_xmlns_ix_sp11},
#line 186 "c/saml2-elems.gperf"
    {"StatusDetail", "sp", zx_ns_tab + zx_xmlns_ix_sp},
#line 209 "c/saml2-elems.gperf"
    {"MgmtData", "ds", zx_ns_tab + zx_xmlns_ix_ds},
#line 110 "c/saml2-elems.gperf"
    {"Attribute", "sa11", zx_ns_tab + zx_xmlns_ix_sa11},
#line 128 "c/saml2-elems.gperf"
    {"Attribute", "sa", zx_ns_tab + zx_xmlns_ix_sa},
#line 245 "c/saml2-elems.gperf"
    {"AttributeValue", "sa11", zx_ns_tab + zx_xmlns_ix_sa11},
#line 253 "c/saml2-elems.gperf"
    {"AttributeValue", "sa", zx_ns_tab + zx_xmlns_ix_sa},
#line 263 "c/saml2-elems.gperf"
    {"faultstring", "se", zx_ns_tab + zx_xmlns_ix_se},
#line 95 "c/saml2-elems.gperf"
    {"IDPProvidedNameIdentifier", "ff12", zx_ns_tab + zx_xmlns_ix_ff12},
#line 211 "c/saml2-elems.gperf"
    {"P", "ds", zx_ns_tab + zx_xmlns_ix_ds},
#line 208 "c/saml2-elems.gperf"
    {"KeyName", "ds", zx_ns_tab + zx_xmlns_ix_ds},
#line 141 "c/saml2-elems.gperf"
    {"NameID", "sa", zx_ns_tab + zx_xmlns_ix_sa},
#line 210 "c/saml2-elems.gperf"
    {"Modulus", "ds", zx_ns_tab + zx_xmlns_ix_ds},
#line 23 "c/saml2-elems.gperf"
    {"DigSig", "ac", zx_ns_tab + zx_xmlns_ix_ac},
#line 40 "c/saml2-elems.gperf"
    {"Password", "ac", zx_ns_tab + zx_xmlns_ix_ac},
#line 78 "c/saml2-elems.gperf"
    {"Transforms", "ds", zx_ns_tab + zx_xmlns_ix_ds},
#line 201 "c/saml2-elems.gperf"
    {"Transforms", "xenc", zx_ns_tab + zx_xmlns_ix_xenc},
#line 212 "c/saml2-elems.gperf"
    {"PGPKeyID", "ds", zx_ns_tab + zx_xmlns_ix_ds},
#line 33 "c/saml2-elems.gperf"
    {"KeySharing", "ac", zx_ns_tab + zx_xmlns_ix_ac},
#line 31 "c/saml2-elems.gperf"
    {"Identification", "ac", zx_ns_tab + zx_xmlns_ix_ac},
#line 154 "c/saml2-elems.gperf"
    {"AttributeQuery", "sp11", zx_ns_tab + zx_xmlns_ix_sp11},
#line 166 "c/saml2-elems.gperf"
    {"AttributeQuery", "sp", zx_ns_tab + zx_xmlns_ix_sp},
#line 238 "c/saml2-elems.gperf"
    {"ProviderID", "ff12", zx_ns_tab + zx_xmlns_ix_ff12},
#line 197 "c/saml2-elems.gperf"
    {"KeyReference", "xenc", zx_ns_tab + zx_xmlns_ix_xenc},
#line 43 "c/saml2-elems.gperf"
    {"PrincipalAuthenticationMechanism", "ac", zx_ns_tab + zx_xmlns_ix_ac},
#line 218 "c/saml2-elems.gperf"
    {"X509CRL", "ds", zx_ns_tab + zx_xmlns_ix_ds},
#line 80 "c/saml2-elems.gperf"
    {"X509IssuerSerial", "ds", zx_ns_tab + zx_xmlns_ix_ds},
#line 63 "c/saml2-elems.gperf"
    {"KeyValue", "ds", zx_ns_tab + zx_xmlns_ix_ds},
#line 77 "c/saml2-elems.gperf"
    {"Transform", "ds", zx_ns_tab + zx_xmlns_ix_ds},
#line 62 "c/saml2-elems.gperf"
    {"KeyInfo", "ds", zx_ns_tab + zx_xmlns_ix_ds},
#line 35 "c/saml2-elems.gperf"
    {"Length", "ac", zx_ns_tab + zx_xmlns_ix_ac},
#line 148 "c/saml2-elems.gperf"
    {"TestElem", "sa", zx_ns_tab + zx_xmlns_ix_sa},
#line 153 "c/saml2-elems.gperf"
    {"detail", "se", zx_ns_tab + zx_xmlns_ix_se},
#line 221 "c/saml2-elems.gperf"
    {"X509SKI", "ds", zx_ns_tab + zx_xmlns_ix_ds}
  };

static const short lookup[] =
  {
      -1,    0,   -1,   -1,    1,   -1,    2,   -1,
      -1,   -1,   -1,    3,   -1,   -1,    4,   -1,
      -1,   -1,   -1,   -1,   -1,   -1,   -1,   -1,
      -1,   -1,   -1,   -1,   -1,   -1,   -1,    5,
      -1,   -1,   -1,   -1,   -1,   -1,   -1,   -1,
      -1,   -1,   -1,    6, -318, -265,   -2,   -1,
       9,   10,   -1,   -1,   11, -666, -664,   -1,
      16,   -1,   17,   18, -662,   21,   -1, -660,
      24,   25,   26,   -1,   27,   -1,   28,   -1,
      29,   30, -349,   34, -241,   -3,   35,   36,
      37, -355, -234,   -2,   40,   41,   -1, -655,
    -363,   46, -228,   -2, -653,   -1,   49,   50,
      -1,   51, -649,   54,   55,   -1,   56,   57,
      58,   59,   -1, -636,   63,   64,   65, -632,
      68,   69,   70,   71,   72,   -1,   73,   74,
      75,   76,   -1,   77,   78,   79,   80,   81,
      -1, -630,   84, -626,   87,   88,   89, -409,
    -182,   -2, -620,   94,   95,   96,   -1,   97,
      98,   99,  100,   -1,  101,   -1,  102,  103,
      -1,  104,  105,  106,  107,   -1, -617,  110,
      -1,  111,  112,  113,   -1,  114,  115, -615,
    -501,   -1,  120,  121,   -1,  122,  123,   -1,
     124,   -1,  125,  126,  127,   -1, -471,  130,
     131, -459, -140,   -2,  134,  135,   -1,  136,
      -1,  137,   -1,  138,   -1,  139, -144,   -2,
     140,  141,  142,   -1, -479,  145, -129,   -2,
     146,   -1,  147,  148, -497,  151,   -1,  152,
     153,   -1,  154,  155,   -1,  156,   -1,  157,
    -123,   -2,  158,  159, -154,   -2,  160,  161,
     162,   -1,  163,  164,  165,  166, -599,  169,
     170, -544,  173,  174,   -1,  175,  176,  177,
     178,  179,  180,  181,   -1,  182,  183,  184,
     185,  186,   -1,  187,  188,  189,  190,  191,
    -538,  -80,   -2,   -1,  194,  195,  196, -101,
      -2,   -1,  197,  198,  199,   -1,  200,  201,
     202,   -1, -559,   -1,  205,  206,  -69,   -2,
     207,  208, -564,  -63,   -2,  211,  212,  213,
     214,   -1,  215,   -1,  216,  217,  218,  219,
      -1,  220,  221,  222,  223,  224,  225,   -1,
    -586,  -46,   -2,  228,  229,   -1, -596,  232,
     233,   -1,  234,  -42,   -2,  235, -105,   -2,
    -602,  -36,   -2,   -1, -610,  240, -608,  -31,
      -2,  -34,   -2, -613,  -29,   -2, -156,   -2,
    -164,   -2,  245, -180,   -2,   -1,  246,  247,
     248, -187,   -2,   -1,  249, -190,   -2, -206,
      -2,   -1,  250, -212,   -3,   -1,  251,   -1,
     252, -643,  -19,   -2,   -1,  255,   -1,  256,
    -220,   -2,   -1,  257, -225,   -2, -230,   -2,
    -658,  -14,   -2, -250,   -2, -253,   -2, -258,
      -2, -260,   -2,   -1,   -1,   -1,   -1,   -1,
      -1,   -1,   -1,   -1,   -1,   -1,   -1,   -1,
      -1,   -1,   -1,   -1,   -1,   -1,   -1,  260,
      -1,   -1,   -1,   -1,   -1,   -1,   -1,   -1,
      -1,   -1,   -1,  261,   -1,   -1,   -1,   -1,
     262,   -1,   -1,   -1,   -1,   -1,   -1,   -1,
      -1,   -1,  263,   -1,   -1,   -1,   -1,   -1,
      -1,   -1,   -1,  264,   -1,  265,   -1,   -1,
      -1,   -1,   -1,   -1,   -1,   -1,   -1,  266,
      -1,   -1,   -1,   -1,   -1,   -1,   -1,   -1,
     267,   -1,   -1,   -1,   -1,   -1,   -1,   -1,
      -1,  268,   -1,   -1,   -1,   -1,   -1,   -1,
      -1,   -1,   -1,   -1,  269,   -1,   -1,   -1,
      -1,   -1,   -1,   -1,   -1,   -1,   -1,   -1,
      -1,   -1,   -1,   -1,   -1,   -1,   -1,   -1,
      -1,   -1,   -1,   -1,   -1,   -1,   -1,   -1,
      -1,   -1,   -1,   -1,   -1,   -1,   -1,   -1,
      -1,   -1,   -1,   -1,   -1,   -1,   -1,   -1,
      -1,   -1,   -1,   -1,   -1,   -1,   -1,   -1,
      -1,   -1,   -1,   -1,   -1,   -1,   -1,   -1,
      -1,   -1,   -1,   -1,  270,   -1,   -1,   -1,
      -1,   -1,   -1,   -1,   -1,   -1,   -1,   -1,
      -1,   -1,   -1,   -1,   -1,   -1,   -1,   -1,
      -1,   -1,   -1,   -1,   -1,   -1,   -1,   -1,
      -1,   -1,   -1,   -1,   -1,   -1,   -1,   -1,
      -1,   -1,   -1,   -1,   -1,   -1,   -1,   -1,
      -1,   -1,   -1,   -1,   -1,   -1,   -1,   -1,
      -1,   -1,   -1,   -1,   -1,   -1,   -1,   -1,
      -1,   -1,   -1,   -1,   -1,   -1,   -1,   -1,
      -1,   -1,   -1,   -1,   -1,   -1,   -1,   -1,
      -1,   -1,   -1,   -1,   -1,   -1,   -1,   -1,
      -1,   -1,   -1,   -1,   -1,   -1,   -1,  271
  };

